package th.ac.ku.foodforfun;




import android.annotation.SuppressLint;
import android.content.Intent;
import android.os.Bundle;
import android.support.design.widget.FloatingActionButton;
import android.support.design.widget.Snackbar;

import android.support.v4.app.FragmentManager;
import android.support.v4.app.FragmentTransaction;
import android.widget.SearchView;
import android.util.Log;
import android.view.MenuInflater;
import android.view.View;
import android.support.design.widget.NavigationView;
import android.support.v4.view.GravityCompat;
import android.support.v4.widget.DrawerLayout;
import android.support.v7.app.ActionBarDrawerToggle;
import android.support.v7.app.AppCompatActivity;
import android.support.v7.widget.Toolbar;
import android.view.Menu;
import android.view.MenuItem;


import java.util.List;

public class NavigationMainActivity extends AppCompatActivity
        implements NavigationView.OnNavigationItemSelectedListener {

    DBAccess databaseAccess;

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_navigation_main);
        Toolbar toolbar = (Toolbar) findViewById(R.id.toolbar);
        setSupportActionBar(toolbar);

        FloatingActionButton fab = (FloatingActionButton) findViewById(R.id.fab);
        fab.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View view) {
                Snackbar.make(view, "Replace with your own action", Snackbar.LENGTH_LONG)
                        .setAction("Action", null).show();
            }
        });

        DrawerLayout drawer = (DrawerLayout) findViewById(R.id.drawer_layout);
        ActionBarDrawerToggle toggle = new ActionBarDrawerToggle(
                this, drawer, toolbar, R.string.navigation_drawer_open, R.string.navigation_drawer_close);
        drawer.addDrawerListener(toggle);
        toggle.syncState();

        NavigationView navigationView = (NavigationView) findViewById(R.id.nav_view);
        navigationView.setNavigationItemSelectedListener(this);


//        accessDB();
        this.databaseAccess = DBAccess.getInstance(this);
//        insertFood();

//        deleteDB();

        HomePage homePage = new HomePage();
        homePage.lstAll = getDataFromDB();
        FragmentTransaction fragmentTransaction = getSupportFragmentManager().beginTransaction();
        fragmentTransaction.replace(R.id.frameLayout, homePage,"fragment1");

        fragmentTransaction.commit();

        setFab();
//        connectDatabase();

    }



    private void setFab() {
        FloatingActionButton fab = (FloatingActionButton) findViewById(R.id.fab);
        fab.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View view) {
                setTitle("HOME");
                HomePage homePage = new HomePage();
                homePage.lstAll = getDataFromDB();
                FragmentTransaction fragmentTransaction = getSupportFragmentManager().beginTransaction();
                fragmentTransaction.replace(R.id.frameLayout, homePage,"fragment1").addToBackStack(null);
                fragmentTransaction.commit();
//                Snackbar.make(view, "Replace with your own action", Snackbar.LENGTH_LONG)
//                        .setAction("Action", null).show();
            }
        });
    }

    private void deleteDB() {
        databaseAccess.open();
        databaseAccess.delete();
    }

    private List<FoodInfo> getDataFromDB() {
        databaseAccess.open();
        List<FoodInfo> list = databaseAccess.getAllData();
        databaseAccess.close();
        return list;
    }


//    private void accessDB() {
//        DBAccess databaseAccess = DBAccess.getInstance(getApplicationContext());
//        databaseAccess.open();
//
//        List<FoodInfo> dataLst =  databaseAccess.getAllData();
//        Log.i("LST", "accessDB: dataLst " + dataLst);
//        template = new Template();
//        template.setAllData(dataLst);
//        databaseAccess.close();
//    }



    @Override
    public void onBackPressed() {
        Log.i("back", "onBackPressed: in");
        DrawerLayout drawer = (DrawerLayout) findViewById(R.id.drawer_layout);
        if (drawer.isDrawerOpen(GravityCompat.START)) {
            drawer.closeDrawer(GravityCompat.START);
        } else {
            int fragments = getSupportFragmentManager().getBackStackEntryCount();
            if (fragments == 0) {
                finish();
            } else {
                if (getFragmentManager().getBackStackEntryCount() > 0) {
                    getFragmentManager().popBackStack();
                } else {
                    super.onBackPressed();
                }
            }
        }
    }

    @Override
    public boolean onCreateOptionsMenu(Menu menu) {
        // Inflate the menu; this adds items to the action bar if it is present.
        getMenuInflater().inflate(R.menu.navigation_main, menu);

        MenuItem menuItem = menu.findItem(R.id.searchView);
        SearchView searchView = (SearchView) menuItem.getActionView();
        searchView.setOnQueryTextListener(new SearchView.OnQueryTextListener() {
            @Override
            public boolean onQueryTextSubmit(String query) {
                Template template = new Template();
                template.setSearchFor(query);
                template.setAllData(getDataFromDB());
                FragmentTransaction fragmentTransaction = getSupportFragmentManager().beginTransaction();
                fragmentTransaction.replace(R.id.frameLayout, template,"fragment2").addToBackStack(null);
                fragmentTransaction.commit();
                return false;
            }

            @Override
            public boolean onQueryTextChange(String newText) {


                return false;
            }
        });
        return true;
    }

    @Override
    public boolean onOptionsItemSelected(MenuItem menu) {
        // Handle action bar item clicks here. The action bar will
        // automatically handle clicks on the Home/Up button, so long
        // as you specify a parent activity in AndroidManifest.xml.
        int id = menu.getItemId();

        //noinspection SimplifiableIfStatement
        if (id == R.id.action_settings) {
            return true;
        }



        return super.onOptionsItemSelected(menu);
    }

    @SuppressLint("ResourceType")
    @SuppressWarnings("StatementWithEmptyBody")
    @Override
    public boolean onNavigationItemSelected(MenuItem item) {
        // Handle navigation view item clicks here.
        int id = item.getItemId();

        if (id == R.id.nav_Home) {
            // Handle the Home action
            setTitle("HOME");
            HomePage homePage = new HomePage();
            homePage.lstAll = getDataFromDB();
            FragmentTransaction fragmentTransaction = getSupportFragmentManager().beginTransaction();
            fragmentTransaction.replace(R.id.frameLayout, homePage,"fragment1").addToBackStack(null);
            fragmentTransaction.commit();
        } else if (id == R.id.nav_breakfast) {
            setTitle("Breakfast");
//            Breakfast breakfast = new Breakfast();
            Template template = new Template();
            template.setSearchFor("Breakfast");
            template.setAllData(getDataFromDB());
            FragmentTransaction fragmentTransaction = getSupportFragmentManager().beginTransaction();
            fragmentTransaction.replace(R.id.frameLayout, template,"fragment2").addToBackStack(null);
            fragmentTransaction.commit();
        } else if (id == R.id.nav_lunch) {
            setTitle("Lunch");

            Template template = new Template();
            template.setSearchFor("Lunch");
            template.setAllData(getDataFromDB());
            FragmentTransaction fragmentTransaction = getSupportFragmentManager().beginTransaction();
            fragmentTransaction.replace(R.id.frameLayout, template,"fragment2").addToBackStack(null);
            fragmentTransaction.commit();
        } else if (id == R.id.nav_dinner) {
            setTitle("Dinner");
            Template template = new Template();
            template.setSearchFor("Dinner");
            template.setAllData(getDataFromDB());
            FragmentTransaction fragmentTransaction = getSupportFragmentManager().beginTransaction();
            fragmentTransaction.replace(R.id.frameLayout, template,"fragment2").addToBackStack(null);
            fragmentTransaction.commit();
        }
        else if (id == R.id.nav_grill) {
            setTitle("Grill");

            Template template = new Template();
            template.setSearchFor("Grill");
            template.setAllData(getDataFromDB());
            FragmentTransaction fragmentTransaction = getSupportFragmentManager().beginTransaction();
            fragmentTransaction.replace(R.id.frameLayout, template,"fragment2").addToBackStack(null);
            fragmentTransaction.commit();
        }
        else if (id == R.id.nav_dessert) {
            setTitle("Dessert");

            Template template = new Template();
            template.setSearchFor("Dessert");
            template.setAllData(getDataFromDB());
            FragmentTransaction fragmentTransaction = getSupportFragmentManager().beginTransaction();
            fragmentTransaction.replace(R.id.frameLayout, template,"fragment2").addToBackStack(null);
            fragmentTransaction.commit();
        }



        DrawerLayout drawer = (DrawerLayout) findViewById(R.id.drawer_layout);
        drawer.closeDrawer(GravityCompat.START);
        return true;
    }
    private void insertFood() {
        System.out.println("inserted");
        databaseAccess.open();
        //breakfast
        databaseAccess.insertContact(new FoodInfo("เครปอาหารเช้า","BREAKFAST",
                "แป้งสาลีอเนกประสงค์ 1/2 ถ้วย," +
                "น้ำตาลทราย 1/2 ช้อนโต๊ะ," + "เกลือป่น 1/4 ช้อนชา," + "นมสด 3/4 ถ้วย," + "ไข่ไก่ 2 ฟอง," + "เนยสดละลาย 1 1/2 ช้อนโต๊ะ," + "แฮมสไลซ์ หรือเบคอน 4-5 แผ่น," + "ไข่ไก่ 4-5 ฟอง," + "พริกไทยป่น เล็กน้อย," + "พาสลีย์หรือผักชีสำหรับแต่ง",
                "ใส่แป้งสาลีอเนกประสงค์ น้ำตาลทราย เกลือป่น นมสด ไข่ไก่ 2 ฟอง และเนยสดละลายลงในเครื่องผสมแป้ง ตีผสมด้วยความเร็วสูง ประมาณ 30 วินาที จากนั้นพักแป้งทิ้งไว้ 15 นาที,นำกระทะเทฟลอนขึ้นตั้งไฟปานกลางค่อนข้างอ่อน ใส่เนยลงไป จากนั้นตักส่วนผสมแป้งใส่ลงในกระทะ กรอกแป้งเป็นแผ่นบาง รอจนแป้งสุกเป็นสีน้ำตาลอ่อน ด้านละประมาณ 1-2 นาที จากนั้นตักขึ้น ทำจนหมด เตรียมไว้,เปิดเตาอบที่อุณหภูมิ 350 องศาฟาเรนไฮต์ เตรียมไว้,นำเครปวางลงบนแผ่นรองอบ วางแฮมสไลซ์ลงตรงกลางของแป้งเครป ตอกไข่ไก่ลงบนแฮม พับมุมแป้งเค้กลงบนไข่ขาวทั้ง 4 มุมเป็นสี่เหลี่ยมจัตุรัส (ใช้ไข่ขาวเป็นตัวยึดแป้ง) โรยเกลือป่น และพริกไทยป่น ทำจนครบ จากนั้นนำเข้าเตาอบ นานประมาณ 10-12 นาที นำออกจากเตา แต่งด้วยพาสลีย์ โรยพริกไทย พร้อมเสิร์ฟ","bk_crep"));
        databaseAccess.insertContact(new FoodInfo("ข้าวต้มกุ้งเวียดนาม","BREAKFAST","กุ้งแชบ๊วย,น้ำมันงา,เกลือ,น้ำซุปไก่,หอมใหญ่หั่นเสี้ยว,ข้าวสวย,โคนต้นหอมหั่นท่อน,ใบต้นหอมซอย,หอมแดงเจียว,พริกไทยบด","ล้างกุ้ง แกะเปลือก เด็ดหัวไว้หาง แล้วผ่าหลังดึงเส้นดำออก เติมน้ำมันงาและเกลือคลุกเคล้าให้ทั่ว หมักนานประมาณ 15 นาที," +
                "ต้มน้ำซุปในหม้อด้วยไฟกลางจนเดือด ใส่หอมใหญ่ต้มจนสุกใสและน้ำซุปมีรสหวาน จากนั้นตักหอมใหญ่ออก,ใส่ข้าวสวยลงต้มจนน้ำซุปขุ่นขาวเป็นน้ำแป้งเล็กน้อย ปรุงรสด้วยเกลือ,เมื่อเดือดอีกครั้งใส่กุ้ง ต้มพอกุ้งสุกใส่โคนต้นหอม ใบต้นหอม (แบ่งไว้โรยหน้าเล็กน้อย) ปิดไฟ,ตักใส่ถ้วย โรยหอมแดงเจียว ใบต้นหอม และพริกไทย","bk_kaotom"));
        databaseAccess.insertContact(new FoodInfo("แมคมัฟฟิน","BREAKFAST","ขนมปังอิงลิชมัฟฟิน 1 ชิ้น," +
                "เบคอนม," + "เนยสำหรับทาขนมปัง," + "ไข่ไก่ 1 ฟอง," + "เชดดาร์ชีส 1 แผ่น," + "ผักโขมลวกสุก," + "ผักสดตามชอบ (เช่น มะเขือเทศหั่นแว่น, ผักสลัด)," + "เกลือป่น," + "พริกไทยป่น","นำขนมปังอิงลิชมัฟฟินมาสไลซ์ครึ่งออกเป็น 2 แผ่น ทาเนยตรงด้านที่เป็นรอยผ่าให้ทั่วแผ่น ทาทั้ง 2 แผ่น (ทาปริมาณมาก-น้อย ตามชอบ) พักไว้,ทำไข่ดาว โดยนำกระทะขึ้นตั้งไฟอ่อน ๆ แล้วทาเนยลงไป พอเนยละลายตอกไข่ไก่ลงไปทอดให้สุกตามชอบ ตักขึ้นใส่จาน พักไว้,ทอดเบคอน โดยใส่เนยลงในกระทะใบเดิม รอจนเนยละลายแล้วนำเบคอนลงทอดจนสุกเหลือง ตักขึ้นพักไว้,ปิ้งขนมปังโดยนำขนมปังด้านที่ทาเนยวางลงในกระทะ รอให้เนยละลายและซึมเข้าขนมปัง จากนั้นกลับด้านขนมปังแล้วนำขึ้นไปพักไว้ 1 ชิ้น,ประกอบร่างแมคมัฟฟิน โดยวางผักโขมลวกสุกลงบนขนมปัง ตามด้วยมะเขือเทศ เบคอนทอด และไข่ดาว โรยเกลือป่น และพริกไทยป่นเล็กน้อย จากนั้นวางเชดดาร์ชีสทับลงไป สุดท้ายประกบด้วยขนมปังอิงลิชมัฟฟินอีกหนึ่งแผ่น กดเบา ๆ ตักใส่จาน พร้อมเสิร์ฟ","bk_macmuffin"));
        databaseAccess.insertContact(new FoodInfo("ออมเล็ต","BREAKFAST","ไข่ไก่ 2 ฟองม,เบคอนหั่นเป็นชิ้นเล็ก ๆ 1 เส้น,เกลือ และพริกไทยดำสำหรับปรุงรส,หอมใหญ่หั่นเต๋าเล็ก 1/2 ลูก,พริกฝรั่งหั่นเต๋า 1/2 ลูก,เนยสด 1 ช้อนโต๊ะ,พาร์มาซานชีสขูดฝอย 10 กรัม"
                ,"ตีผสมไข่ไก่กับเกลือ และพริกไทยดำ,ตั้งกระทะพอร้อน ใส่เนยลงผัดกับเบคอน หอมใหญ่ และพริกฝรั่งจนสุก เทส่วนผสมไข่ลงไป ใช้ไฟปานกลาง คนผสมจนไข่เริ่มสุก ใส่พาร์มาซานชีส กรอกไข่ให้เป็นทรงรี ตักใส่จาน เสิร์ฟคู่กับซอสมะเขือเทศ ขนมปัง ชา หรือกาแฟ","bk_omlet"));
        databaseAccess.insertContact(new FoodInfo("โจ๊กหมู","BREAKFAST","หมูสับปรุงรส   1/4 ถ้วยตวง,กระเพาะหมู  ต้มจนนุ่มหั่นชิ้น   2 ชิ้น,ไข่ไก่ต้มสุก     (เปลี่ยนเป็นไข่ลวกก็ได้),น้ำซุปหมู   1 1/2 ถ้วยตวง,โจ๊กเปล่า   1 ถ้วยตวง"
                ,"นำโจ๊กใส่หม้อ ใส่น้ำซุปหมู ยกขึ้นตั้งไฟคนให้เข้ากันจนกระทั่งเนื้อโจ๊กเนียน,ใส่ หมูสับปรุงรส  ปั้นเป็นก้อนกลม ๆ ต้มจนกระทั่งหมูสุกตักใส่ชาม,ใส่ กระเพาะหมู  หัวใจหมู  ตับหมู  ไส้อ่อนหมู  และ ไข่ต้ม (เปลี่ยนเป็นไข่ลวกก็ได้)   โรยหน้าด้วยขิงและต้นหอม จัดเสิร์ฟ","bk_joke"));
        databaseAccess.insertContact(new FoodInfo("แซนด์วิชทอดไส้แฮมไข่ดาว","BREAKFAST",
                "ขนมปังโฮลวีท   6 แผ่น,แฮมชนิดแผ่น   6 แผ่น,ไข่ดาว   3 ฟอง,ไข่ไก่ตีพอแตก   1 ฟอง,มายองเนสสำหรับทา,เกล็ดขนมปังสำหรับคลุก,น้ำมันพืชสำหรับทอด"
                ,"ใช้ไม้คลึงแป้งรีดขนมปังแซนด์วิชให้แบน  ทาด้วยมายองเนส  วางแฮม ไข่ดาว ประกบด้วยขนมปังแซนด์วิชอีกแผ่น,นำขนมปังแซนด์วิชที่ห่อไว้ชุบไข่ไก่  แล้วคลุกเกล็ดขนมปังให้ทั่ว  ใส่ลงทอดในน้ำมันพืช พอร้อนไฟปานกลาง จนสุกเหลือง  ตักขึ้นพักไว้ให้สะเด็ดน้ำมัน  พร้อมเสิร์ฟ","bk_sand"));

        //lunch
        databaseAccess.insertContact(new FoodInfo("ปลาดอร์ลี่ทอดยำผักชี","LUNCH","เนื้อปลาดอร์ลี่    300 กรัม," +
                "ผักชีซอย    1/2 ถ้วยตวง," + "พริกสดสีแดงโขลก    7 เม็ด," + "หอมแดงซอย    1/4 ถ้วยตวง," + "น้ำมะนาว    2 1/2 ช้อนโต๊ะ," + "น้ำตาลทราย    1 ช้อนโต๊ะ," + "น้ำปลา    1 1/2 ช้อนโต๊ะ," + "ไข่ไก่    1 ฟอง," + "แป้งสาลีอเนกประสงค์สำหรับคลุก," + "เกล็ดขนมปังสำหรับคลุก," + "น้ำมันพืชสำหรับทอด","ผสมพริกสด น้ำมะนาว น้ำตาลทราย น้ำปลา หอมแดง ผักชี คนพอเข้ากันพักไว้,นำเนื้อปลาดอร์ลี่คลุกแป้งสาลี ไข่ไก่ และเกล็ด - ขนมปังให้ทั่ว นำลงทอดในน้ำมันพืชร้อนไฟปาน - กลาง จนสุกเหลืองทั้ง 2 ด้าน ตักขึ้นพักไว้ให้ สะเด็ดน้ำมัน,ใส่เนื้อปลาที่ทอดไว้ในอ่างผสม ราดด้วยน้ำยำที่ ผสมไว้ในข้อที่ 1 คลุกเคล้าให้เข้ากัน ตักใส่ภาชนะ จัดเสิร์ฟ","lun_dolli"));
        databaseAccess.insertContact(new FoodInfo("ไก่อบซอส","LUNCH","ปีกไก่    500 กรัม," +
                "ซอสสเต๊กสำเร็จรูป    3 ช้อนโต๊ะ," + "เนยสดชนิดเค็ม    1 ช้อนโต๊ะ," + "พริกหวานสีเขียว สีแดง สีเหลืองหั่นชิ้น    150 กรัม"
                ,"ผสมปีกไก่ เนยสด ซอสสเต๊ก คลุกเคล้าให้เข้ากัน หมักทิ้งไว้ 20 - 30 นาที,นำปีกไก่ที่หมักได้ที่ใส่ภาชนะ ตามด้วยพริกหวาน นำเข้าอบที่อุณหภูมิ 180 องศาเซลเซียส เวลาประมาณ  20 - 30 นาที หรือจนไก่สุก จัดใส่ภาชนะ จัดเสิร์ฟ","lun_kaiop"));
        databaseAccess.insertContact(new FoodInfo("น้ำพริกปลาทูผักสด","LUNCH","ปลาทูนึ่งขนาดกลาง    1 ตัว," +
                "หอมแดงหั่นหยาบ    1/2 ถ้วยตวง," + "กระเทียมกลีบเล็ก    1/4 ถ้วยตวง," + "พริกสดสีแดง     10 เม็ด,"+ "พริกชี้ฟ้าสีเขียวหั่นท่อนสั้น    2 เม็ด,"+"น้ำปลา    1 ช้อนโต๊ะ,"+"น้ำมะนาว    2 ช้อนโต๊ะ,"+"น้ำตาลทราย    1 1/2 ช้อนชา"
                ,"นำใบตองห่อปลาทู ปิ้งบนเตาไฟจนเหลืองมีกลิ่นหอม แกะเอาแต่เนื้อพักไว้,ใส่หอมแดง กระเทียม พริกสด และพริกชี้ฟ้า ลงในกระทะ คั่วด้วยไฟอ่อนจนสุกเหลือง ตักใส่ครกโขลกให้ละเอียด,ใส่เนื้อปลาทูปิ้งโขลกพอเข้ากัน ปรุงรสด้วย น้ำมะนาว น้ำปลา น้ำตาลทราย คนพอเข้ากัน ตักใส่ภาชนะ จัดเสิร์ฟพร้อมผักสดต่าง ๆ","lun_numprik"));
        databaseAccess.insertContact(new FoodInfo("ปลาย่างเนยปาปริก้า","LUNCH","เนื้อปลากะพง (น้ำหนักประมาณ 250 กรัม)    1 ชิ้น," +
                "เนยสดชนิดเค็ม    1 ช้อนโต๊ะ," + "มายองเนส    6 ช้อนโต๊ะ," + "ปาปริก้า    2  ช้อนชา,"+ "พาร์สเลย์สับหยาบ    1/2 ช้อนชา,"+"น้ำมันพืชเล็กน้อย,"+"เกลือป่นหยาบสำหรับโรย,"+"พริกไทยดำป่นสำหรับโรย"
                ,"ผสมมายองเนส ปาปริก้า พาร์สเลย์ คนพอ เข้ากันพักไว้,ตั้งกระทะใส่น้ำมันพืช นำเนื้อปลากะพงลงกริลล์ โรยเกลือป่น พริกไทยดำ พอทั่ว กริลล์จนปลามี  ลักษณะเหลืองกรอบ,ใส่เนยสดพอละลาย ตักขึ้นใส่ภาชนะ จัดเสิร์ฟ พร้อมซอสมายองเนสปาปริก้า","lun_papika"));
//        databaseAccess.insertContact(new FoodInfo("วุ้นเส้นผัดกุ้งใส่ผักกระเฉด","Lunch","กุ้งสดปอกเปลือกผ่าหลังดึงเส้นดำออก   5 ตัว," +
//                "วุ้นเส้น ตราหงษ์ แช่น้ำพอนุ่ม    150 กรัม," + "ผักกระเฉดเด็ดเป็นท่อนสั่น ๆ    2/3 ถ้วยตวง," + "กระเทียม     3 กลีบ,"+ "พริกขี้หนูสวน    5 เม็ด,"+"พริกชี้ฟ้าสีแดง      1 เม็ด,"+"เกะปิ    1 ช้อนชา,"+"ซอสหอยนางรม     2 ช้อนโต๊ะ,ซีอิ๊วขาว    1 ช้อนโต๊ะ,น้ำตาลทราย     1 ช้อนโต๊ะ,น้ำมันถั่วเหลือง      2 ช้อนโต๊ะ"
//                ,"โขลกกระเทียม พริกขี้หนู พริกชี้ฟ้า ให้ละเอียด ใส่กะปิ โขลกให้เข้ากัน,ตั้งกระทะด้วยไฟกลางใส่น้ำมันถั่วเหลืองพอร้อน นำเครื่องที่โขลกไว้ลงผัดให้หอม ใส่กุ้งผัดจนกุ้งเปลี่ยนสี เติมน้ำเปล่าเล็กน้อย ปรุงรสด้วย ซอสหอยนางรม ซีอิ๊วขาว น้ำตาลทราย,เร่งไฟแรงขึ้น ใส่ผักกระเฉด วุ้นเส้น ตราหงษ์ ผัดให้เข้ากัน ตักใส่ภาชนะเสิร์ฟ","lun_noodle"));
//        databaseAccess.insertContact(new FoodInfo("แกงเขียวหวานเป็ดสด","Lunch","สะโพกเป็ดหั่นชิ้น   200 กรัม," +
//                "น้ำพริกแกงเขียวหวาน   2 ช้อนโต๊ะ," + "หัวกะทิ    1/4 ถ้วยตวง," + "น้ำกะทิความเข้มข้นปานกลาง    1 1/4 ถ้วยตวง,"+ "มะเขือเปราะผ่าสี่    5 ลูก,"+"มะเขือพวง    2 ช้อนโต๊ะ,"+"ใบโหระพา    1/4 ถ้วยตวง,น้ำปลา  1 ช้อนโต๊ะ,น้ำตาลปี๊บ    2 ช้อนชา,ใบมะกรูดฉีก    3 ใบ,พริกชี้ฟ้าสีเขียวหั่นแฉลบ    1 เม็ด,พริกชี้ฟ้าสีแดงหั่นแฉลบ    1 เม็ด,น้ำมันพืช  2 ช้อนโต๊ะ"
//                ,"โขลกกระเทียม พริกขี้หนู พริกชี้ฟ้า ให้ละเอียด ใส่กะปิ โขลกให้เข้ากัน,ตั้งกระทะด้วยไฟกลางใส่น้ำมันถั่วเหลืองพอร้อน นำเครื่องที่โขลกไว้ลงผัดให้หอม ใส่กุ้งผัดจนกุ้งเปลี่ยนสี เติมน้ำเปล่าเล็กน้อย ปรุงรสด้วย ซอสหอยนางรม ซีอิ๊วขาว น้ำตาลทราย,เร่งไฟแรงขึ้น ใส่ผักกระเฉด วุ้นเส้น ตราหงษ์ ผัดให้เข้ากัน ตักใส่ภาชนะเสิร์ฟ","lun_greensweet"));



        //Dinner
        databaseAccess.insertContact(new FoodInfo("ไข่ฟูยำสมุนไพร","DINNER","ไข่เป็ดตีพอแตก    2 ฟอง," + "ขิงหั่นชิ้นสี่เหลี่ยมลูกเต๋า    ¼ ถ้วยตวง," + "หอมแดงหั่นชิ้นสี่เหลี่ยมลูกเต๋า    ¼ ถ้วยตวง," + "พริกสดสีแดงซอย    2 ช้อนโต๊ะ,"+ "มะนาวหั่นชิ้นสี่เหลี่ยมลูกเต๋า    1 ช้อนโต๊ะ,"+"ตะไคร้ซอย    2 ช้อนโต๊ะ,"+"น้ำปลา    1 ½ ช้อนโต๊ะ,"+"น้ำตาลปี๊บ    2 ½ ช้อนชา,น้ำมะนาว    3 ช้อนโต๊ะ,น้ำมันพืชสำหรับทอด,ใบสะระแหน่สำหรับโรย"
                ,"ตั้งกระทะใส่น้ำมันพืชพอร้อน นำไข่เป็ดใส่กระชอน ร่อนเป็นเส้น ๆ ให้เป็นแพพอสุกเหลือง ตักขึ้นพักไว้ให้สะเด็ดน้ำมัน,ผสมน้ำปลา น้ำมะนาว น้ำตาลปี๊บ และพริกสด คนให้เข้ากัน,ใส่ตะไคร้ มะนาว หอมแดง ขิง และไข่ฟู (ส่วนผสมในข้อที่ 1) คลุกเคล้าให้เข้ากันอีกครั้ง โรยใบสะระแหน่ ตักใส่ภาชนะ จัดเสิร์ฟ","din_eggfoo"));
        databaseAccess.insertContact(new FoodInfo("แจ่วบอง","DINNER","พริกขี้หนูแห้งคั่วป่นละเอียด    1/2 ถ้วยตวง," +
                "ปลาร้าปลากระดี่สับละเอียด (เปลี่ยนเป็นปลาร้าปลาช่อนได้)    150 กรัม," + "หอมแดงหั่นหยาบ    1/2 ถ้วยตวง," + "กระเทียมไทยกลีบเล็ก    1/2 ถ้วยตวง,"+ "ข่าซอย    1/4 ถ้วยตวง,"+"ตะไคร้ซอย    1/4 ถ้วยตวง,"+"เนื้อมะขามเปียกสับละเอียด    50 กรัม,"+"น้ำตาลปี๊บ    2 1/2 ช้อนชา,ใบมะกรูดซอย    1/4 ถ้วยตวง,ผักสด"
                ,"ตคั่วข่า ตะไคร้ หอมแดง และกระเทียม ทีละอย่างด้วยไฟอ่อนจนสุกเหลือง,โขลกส่วนผสมในข้อที่ 1 ที่คั่วไว้รวมให้ละเอียด,ใส่ปลาร้าสับ พริกขี้หนูแห้งคั่วป่น เนื้อมะขามเปียก โขลกเบาๆ พอเข้ากัน ปรุงรสด้วยน้ำตาลปี๊บ ใส่ใบมะกรูด คนให้เข้ากัน ตักใส่ภาชนะ จัดเสิร์ฟคู่กับผักสด","din_jaew"));
        databaseAccess.insertContact(new FoodInfo("หมูอบซอสเทริยากิ","DINNER","หมูสามชั้น    350 กรัม," +
                "น้ำเปล่า    3 ถ้วยตวง," + "ซอสเทริยากิ (1)    1/2 ถ้วยตวง," + "ซอสเทริยากิ (2)    1/2 ถ้วยตวง,"+ "พริกไทยดำป่น    1/4 ช้อนชา,"+"ขิงสับละเอียด    2 ช้อนโต๊ะ,"+"ขิงดอง"
                ,"ใส่น้ำเปล่า หมูสามชั้น ซอสเทริยากิ (1) ลงในหม้อ ตั้งไฟต้มจนเดือดและหมูนุ่ม ตักขึ้นพักไว้ให้สะเด็ดน้ำ,ใช้ส้อมจิ้มหนังหมูจนทั่ว จากนั้นนำหมูเข้าอบที่อุณหภูมิ 200 องศาเซลเซียส ประมาณ 50 - 60 นาที หรือจนสุกเหลือง (ขณะอบให้ทาด้วยน้ำที่เหลือจากการต้ม),ผสมซอสเทริยากิ (2) น้ำเปล่า พริกไทยดำป่น และขิงเข้าด้วยกัน ยกขึ้นตั้งไฟ เคี่ยวจนมีลักษณะข้นเล็กน้อย ยกลง,หั่นหมูอบเป็นชิ้นราดด้วยส่วนผสมในข้อที่ 3 จัดเสิร์ฟพร้อมขิงดอง","din_mhoo"));
        databaseAccess.insertContact(new FoodInfo("ผัดเต้าหู้ปลากุยช่ายขาว","DINNER","ใบกุยช่ายขาว    100 กรัม," +
                "เต้าหู้ปลา    150 กรัม," + "กระเทียมสับ    1 ช้อนโต๊ะ," + "ซอสเห็ดหอม    1 ช้อนโต๊ะ,"+ "ซีอิ๊วขาว    1 ช้อนชา,"+"ซอสปรุงรส    1/2 ช้อนชา,"+"น้ำปลา    1/2 ช้อนชา,น้ำตาลทราย    1 ช้อนชา,น้ำเปล่า    2 ช้อนโต๊ะ,น้ำมันพืช    1 ช้อนโต๊ะ"
                ,"ตั้งกระทะใส่น้ำมันพืชพอร้อน ใส่กระเทียมลงผัดพอหอม ใส่เต้าหู้ปลาลงผัดพอสุก,ใส่กุยช่ายขาวลงผัดพอสุก ปรุงรสด้วย ซอสเห็ดหอม ซีอิ๊วขาว ซอสปรุงรส น้ำปลา น้ำตาลทราย เติมน้ำเปล่า ผัดพอเข้ากัน ยกลง ตักใส่ภาชนะ จัดเสิร์ฟ","din_taohuu"));
        databaseAccess.insertContact(new FoodInfo("แกงคั่วผักบุ้งปลาขูด","DINNER","เนื้อปลากรายขูด   300 กรัม,ผักบุ้งไทยหั่นท่อน   200 กรัม,ใบมะกรูดฉีกก้านกลางออก   3 ใบ,พริกชี้ฟ้าสีแดงหั่นแฉลบ   1 เม็ด,น้ำพริกแกงคั่ว    2 ช้อนโต๊ะ,น้ำปลา   2 1/2 ช้อนโต๊ะ,น้ำตาลปี๊บ   2 ช้อนโต๊ะ,น้ำมะขามเปียก   3 ช้อนโต๊ะ,หัวกะทิ    1/2 ถ้วยตวง" +
                ",กะทิเข้มข้นปานกลาง    2 ถ้วยตวง,น้ำเย็นจัด    2 ช้อนโต๊ะ,เกลือป่นหยาบ    1 ช้อนชา"
                ,"โขลกเนื้อปลากรายกับน้ำเย็นผสมเกลือป่น โขลกพอเนื้อปลากรายเหนียว พักไว้,ใตั้งกระทะใส่หัวกะทิ น้ำพริกแกงคั่ว ผัดพอแตกมัน เติมกะทิเข้มข้นปานกลาง,ปั้นเนื้อปลากรายที่โขลกไว้ ใส่ในส่วนผสมข้อที่ 2 ปรุงรสด้วยน้ำปลา น้ำตาลปี๊บ น้ำมะขามเปียก,ใส่ใบมะกรูด พริกชี้ฟ้า ผักบุ้ง คนพอเข้ากันรอผักบุ้งสุก ปิดไฟ ตักใส่ภาชนะ จัดเสิร์ฟ","din_kangkour"));

        databaseAccess.insertContact(new FoodInfo("แกงคั่วผักรวม","DINNER","เเนื้อแกะส่วนริบช็อพ    300 กรัม,หัวกะทิ     1 ถ้วยตวง,หางกะทิ     2 1/2 ถ้วยตวง,น้ำพริกแกงคั่ว      3 ช้อนโต๊ะ,ฟักทอง หั่นชิ้นหนาประมาณ 1 เซนติเมตร    70 กรัม,ฟักแม้ว หั่นชิ้น     70 กรัม,มะเขือม่วง หั่นตามขวาง 2 เซนติเมตร    2 ลูก,มะเขือพวง    3 ช้อนโต๊ะ,ใบโหระพา    1 กิ่ง,มะเขือเทศสีดา    5 ลูก,น้ำปลา     2-3 ช้อนชา,น้ำตาลปี๊บ     1/2 ช้อนชา,น้ำมันพืช    1 ช้อนโต๊ะ"
                ,"ใส่หางกะทิลงในหม้อตั้งไฟพอเดือดเบาไฟอ่อน ใส่เนื้อแกะลงเคี่ยวให้เปื่อยนุ่ม,ปใส่น้ำมันพืชลงในกระทะตั้งไฟพอร้อน ใส่น้ำพริกแกงคั่ว ลงผัดให้หอมและสุก ค่อยๆ เติมหัวกะทิทีละน้อยพอน้ำพริกหอมตักใส่หม้อที่เคี่ยวเนื้อแกะไว้,เติมหัวกะทิที่เหลือลงในหม้อพอเดือด ใส่ผักทุกชนิด  (ยกเว้นโหระพา) ลงแกงพอผักสุก ปรุงรสด้วยน้ำปลา น้ำตาลปี๊บ ชิมรสตามชอบ,ส่ใบโหระพากดให้จมน้ำแกงพอเดือดยกลง","din_kangmix"));


        //grill
        databaseAccess.insertContact(new FoodInfo("ไก่ย่างหนังกรอบ","GRILL","น่องไก่ติดสะโพก," +
                "ผงกะหรี่ไทย," + "เกลือป่น," + "พริกไทยดำบดหยาบ,"+ "น้ำมันมะกอก (เล็กน้อย)"
                ,"คลุกน่องไก่ติดสะโพกกับผงกะหรี่ให้ทั่ว โรยเกลือป่นกับพริกไทยดำเล็กน้อย หมักทิ้งไว้ 30 นาที,ตั้งกระทะใช้ไฟอ่อน ใส่น้ำมันมะกอกลงไปเล็กน้อย พอน้ำมันเริ่มร้อนนำไก่ลงไปย่างโดยเอาด้านที่ติดหนังลงไปย่างก่อน 10 นาที จากนั้นพลิกอีกด้านย่างต่อประมาณ 25 นาทีหรือจนไก่สุก ตักออกมาใส่ภาชนะ พร้อมเสิร์ฟ","gr_chicken"));
        databaseAccess.insertContact(new FoodInfo("อกไก่ย่าง","GRILL","เนื้ออกไก่ (แล่เป็นชิ้นบาง ๆ)," +
                "พริกไทยป่น," + "เกลือป่น," + "ออริกาโน่,"+ "เนยสด,กระเทียมปอกเปลือก สับละเอียด,ซอสสเต๊ก"
                ,"โรยเกลือป่น พริกไทยป่น และออริกาโน่ ให้ทั่วเนื้อไก่,ตใส่เนยสด กระเทียม และซอสสเต๊กลงในภาชนะสำหรับเข้าไมโครเวฟ แล้วนำเข้าไมโครเวฟสักครู่จนเนยละลายเข้ากันดี,นำส่วนผสมเนยใส่ลงไปผสมกับเนื้อไก่ที่หมักไว้ คนผสมให้เข้ากัน,นำไก่ไปย่างในกระทะจนสุก ตักใส่จาน พร้อมเสิร์ฟ","gr_okekai"));
        databaseAccess.insertContact(new FoodInfo("ปลากะพงย่างซอสมิโซะ","GRILL","เนื้อปลากะพง (แล่เป็นชิ้น)    300 กรัม," +
                "มิโซะ    80 กรัม," + "มิริน (เหล้าหวานญี่ปุ่น)    1 ช้อนโต๊ะ," + "ไข่ไก่ (เฉพาะไข่แดง)    1 ฟอง,"+ "น้ำมันพืช (สำหรับทาตะแกรง),หัวไช้เท้าขูด,ข้าวสวยญี่ปุ่น"
                ,"นำมิโซะและมิริน เทใส่กระทะ ตั้งไฟอ่อน กวนผสมจนเข้ากัน ใส่ไข่แดงลงไป คนจนเป็นเนื้อเดียวกัน พักไว้,ตั้งไฟสำหรับย่าง ทาน้ำมันพืชให้ทั่วตะแกรง ทาซอสมิโซะให้ทั่วเนื้อปลากะพง นำไปย่างด้วยไฟอ่อนจนสุก จัดเสิร์ฟพร้อมกับหัวไช้เท้าขูด และข้าวสวยญี่ปุ่น","gr_plakapong"));
        databaseAccess.insertContact(new FoodInfo("สเต๊กพอร์คชอป","GRILL","เพอร์คชอป (น้ำหนัก 150-200 กรัม)   1 ชิ้น," +
                "พริกไทยดำบดหยาบ    1 ช้อนโต๊ะ," + "น้ำมันมะกอก    1 ช้อนโต๊ะ," + "เกลือป่น    1/2 ช้อนชา,"+ "น้ำมันมะกอก (สำหรับย่าง),หเนยจืด    5 ช้อนโต๊ะ,หอมใหญ่สับละเอียด    2 ช้อนโต๊ะ,อาโรมาต    1 ช้อนช,เกลือป่น (สำหรับปรุงรส),พริกไทยป่น (สำหรับปรุงรส),น้ำเปล่า"
                ,"เคล้าผสมพอร์คชอปกับพริกไทยดำและน้ำมันมะกอกให้ทั่วชิ้น นำเข้าแช่เย็นประมาณ 30 นาที จากนั้นนำออกจากตู้เย็น โรยเกลือป่นให้ทั่ว วางลงบนถาดสำหรับอบที่ทาน้ำมันมะกอกไว้แล้ว,ตเปิดเตาอบที่อุณหภูมิ 200 องศาเซลเซียส ประมาณ 10 นาที เตรียมไว้ จากนั้นนำพอร์คชอปเข้าเตาอบประมาณ 5 นาที ยกออกจากเตา เตรียมไว้,ตั้งกระทะใช้ไฟปานกลางรอจนร้อน ใส่น้ำมันมะกอก เนยสด และหอมใหญ่ลงผัดจนสุกใส ปรุงรสด้วยอาโรมาต เกลือป่น และพริกไทยป่น เติมน้ำเปล่าเล็กน้อย ชิมรสตามชอบ ผัดจนน้ำเปลี่ยนเป็นสีน้ำตาล ยกลงจากเตา เทใส่ภาชนะ เตรียมไว้,นำกระทะขึ้นตั้งไฟ ใส่พอร์คชอปลงย่างจนสุกทั้งสองด้าน ยกลงจากเตา ตักใส่จาน ราดด้วยน้ำซอส พร้อมเสิร์ฟ","gr_porkchop"));
        databaseAccess.insertContact(new FoodInfo("ปลาซาบะย่างเกลือ","GRILL","ปลาซาบะ    1 ตัว,เกลือ เล็กน้อย,เลมอน หรือ มะนาว    1 ซีก,หัวไช้เท้าขูด    2 ช้อนโต๊ะ"
                ,"นำปลาซาบะมาแล่แล้วล้างเลือดกับเมือกออกให้หมด จากนั้นซับด้วยทิชชูให้แห้ง,ปูฟอยล์บนถาดรองอบ วางเนื้อปลาซาบะให้หนังอยู่ด้านล่าง นำเข้าเตาอบ (ติ๊ง) เป็นเวลา 10 นาที,พอครบ 10 นาทีให้นำปลาซาบะออกมาโรยเกลือแล้วพลิกเอาด้านหนังขึ้น จากนั้นก็โรยเกลืออีกด้าน นำกลับเข้าอบอีก 10-15 นาที,มื่ออบเสร็จแล้วนำมาจัดใส่จาน แต่งด้วยหัวไช้เท้าขูดกับเลมอน พร้อมเสิร์ฟ","gr_saba"));
        databaseAccess.insertContact(new FoodInfo("ซี่โครงหมูบาร์บีคิว","GRILL","ซอสมะเขือเทศ   3 ถ้วย,ซอสพริก   2 ถ้วย,ขิงอ่อนสับละเอียด   1/3 ถ้วย,กระเทียมสับละเอียด   1/3 ถ้วย,ออริกาโน่   2 ช้อนโต๊ะ,โรสแมรี   1 ช้อนโต๊ะ,อบเชยป่น   2 ช้อนโต๊ะ,เกลือ   1/2 ช้อนชา,พริกไทยขาวป่น ประมาณ   1 ช้อนโต๊ะ, น้ำผึ้ง   1/4 ถ้วย (ถ้าไม่มีให้ใช้น้ำตาลทราย),ซี่โครงหมูแบบแผ่น   2 กิโลกรัม, น้ำเปล่า   4 ถ้วย"
                ,"ทำซอสบาร์บีคิวโดยผสมซอสมะเขือเทศกับซอสพริกเข้าด้วยกัน ตามด้วยขิงอ่อนสับ กระเทียมสับ ออริกาโน่ โรสแมรี อบเชย เกลือ พริกไทยขาวป่น และน้ำผึ้ง คนผสมให้เข้ากันเป็นซอสบาร์บีคิว พักไว้,ตัดซี่โครงให้เป็นชิ้นตามที่ชอบ (เพื่อให้ใส่หม้อหรือกระทะได้ง่าย ใครมีหม้อใหญ่ ๆ จะใส่ทั้งแผ่นก็ได้ตามสะดวก," +
                "ใส่ซอสบาร์บีคิวลงในกระทะ (หรือหม้อ) เติมน้ำเปล่าลงไปคนผสมให้ซอสละลายเข้ากัน จากนั้นนำซี่โครงใส่ลงไปในหม้อ ต้มพอเดือดแล้วเคี่ยวต่อด้วยไฟอ่อนประมาณ 1.30-2 ชั่วโมง,มนำซี่โครงที่เราเคี่ยวจนเนื้อนุ่มและซอสซึมเข้าเนื้อแล้วมาทาซอสบาร์บีคิวให้ชุ่ม,จากนั้นนำไปอบ (หรือย่างตามสะดวก) ที่อุณหภูมิ 180 องศาเซลเซียส ประมาณ 10-13 นาที ส่วนซอสที่เหลือเก็บไว้ราดอีกทีก่อนเสิร์ฟ","gr_bbq"));



        //dessert
        databaseAccess.insertContact(new FoodInfo("เค้กกล้วยหอม","DESSERT","แป้งเค้ก    200 กรัม," +
                "ผงฟู    1 1/2 ช้อนชา," + "เบคกิ้งโซดา    1 ช้อนชา," + "เกลือป่น    1/2 ช้อนชา,"+ "ไข่ไก่    2 ฟอง,น้ำตาลทราย    165 กรัม,เนยเค็ม    80 กรัม,นมข้นจืด    1/2 ถ้วย,กล้วยหอมสุกบด    2 ลูก"
                ,"ร่อนแป้งเค้ก ผงฟู เบคกิ้งโซดา และเกลือป่น ร่อนรวมกัน แล้ววางพักไว้,ตีไข่ใส่ชามผสม ตามด้วยน้ำตาลทราย ตีจนน้ำตาลละลาย ใส่เนยเค็ม(ละลาย) และนมข้นจืด ตีให้เข้ากัน,ทยอยใส่แป้งที่ร่อนไว้แล้วลงไป แล้วค่อยๆ ตีจนแป้งหมด ตัวขนมเริ่มเป็นสีขาวเนียนขึ้นฟู,เทกล้วยบดลงไป ใช้พายตะล่อมให้กล้วยบดกับแป้งเข้ากันดี,ตั้งหม้อสำหรับนึ่ง ต้มให้เดือด ระหว่างรอก็เตรียมแม่พิมพ์สำหรับใส่ขนม,หยอดขนมใส่ลงไปในแม่พิมพ์ ใส่ไม่ต้องเต็มพิมพ์ เหลือพื้นที่เผื่อไว้ตอนขึ้นฟู,นำขนมไปนึ่ง ใช้เวลา 15 นาที หากเป็นพิมพ์เล็ก ก็ใช้เวลา 12 นาทีก็พอ หรือสังเกตสีขนมหากเป็นสีน้ำตาลก็ถือว่าสุกแล้ว","des_banana"));
        databaseAccess.insertContact(new FoodInfo("บานอฟฟี่","DESSERT","เนยสดรสจืด," +
                "คาราเมล," + "กล้วยหอม 3 ผล," + "วิปปิ้งครีม,"+ "เกลือเล็กน้อย,ผงโกโก้"
                ,"รละลายเนยในไมโครเวฟ บดเครกเกอร์ให้ละเอียด เครกเกอร์ในที่นี้สามารถเลือกเป็นรสชาติใดก็ได้ ถ้าอยากให้บานอฟฟี่มีรสชาติเข้มข้นมากขึ้นก็เลือกใช้โอริโอ้ก็ได้,เทเนยละลายลงไปในเครกเกอร์ที่บดละเอียด คลุกให้เข้ากันจนเนยแทรกซึมเข้าในในตัวเครกเกอร์บด,กรุเครกเกอร์ลงในแม่พิมพ์ จะใช้เป็นภาชนะอะไรก็ได้ ถ้าไม่มีบล็อคทำขนมเค้กก็ใช้เป็นแก้วแทนก็ได้ค่ะ กรุเครกเกอร์ให้แน่นให้ฐานแข็งแรง แช่ตู้เย็นไว้ระหว่างทำอย่างอื่นไปด้วย เพื่อให้เนยที่ผสมในเครกเกอร์เขาจับตัวเมื่อโดนความเย็น,ตีวิปปิ้งครีมให้ฟู ใส่เกลือเล็กน้อยเพื่อเพิ่มรสชาติความมันและให้วิปครีมทรงตัว ตีจนครีมตั้งยอดได้,เอาเครกเกอร์ออกจากตู้เย็น ราดคาราเมลลงบนฐาน วางกล้วยหอมที่หั่นเป็นแว่นๆ ลงให้ทั่วแม่พิมพ์ และราดคาราเมลลงไปอีก ปาดหน้าให้เรียบ,บีบวิปปิ้งครีมลงไปให้ทั่วพาย ปาดหน้าให้เรียบ และโรยหน้าด้วยผงโกโก้เพื่อความสวยงาม","des_banof"));
        databaseAccess.insertContact(new FoodInfo("บราวนี่","DESSERT","กะทิ    1 ถ้วย," +
                "ไข่ไก่    2 ฟอง," + "กลิ่นวานิลลา    1 ช้อนชา," + "น้ำตาลทราย    2 ถ้วย,"+ "เกลือ    1 ช้อนชา,ผงฟู    2 ช้อนช,แป้งสาลีอเนกประสงค์    1 1/2 ถ้วยา,ผงโกโก้ 1 1/4 ถ้วย,อัลมอนด์สไลด์ ตามชอบ"
                ,"นำกะทิไปตีกับไข่ไก่ กลิ่นวานิลลา และ น้ำตาลทราย ตีให้พอเข้ากัน,จากนั้นใส่เกลือ ผงฟู แป้งสาลี และ ผงโกโก้ คนให้เข้ากันอีกครั้ง,เตรียมเตาอบ เปิดวอร์มไว้ที่ 180 องศส เป็นเวลา 10 นาที,นำกระดาษไขมากรุแม่พิมให้ทั่วแล้วทาด้วยเนย เพื่อให้ขนมหลุดออกจากพิมพ์ได้ง่าย หลังจากนั้นโรยอัลมอนด์สไลด์ให้ทั่วหน้าบราวนี่,เมื่อวอร์มเตาเสร็จแล้ว นำขนมเข้าไปอบใช้ความร้อนเท่าเดิม เวลาอบ 30 นาที,อบเสร็จแล้ว รอให้เย็นสักพักแล้วตัดเป็นชิ้นพอดีคำ","des_brownie"));
        databaseAccess.insertContact(new FoodInfo("ทาร์ตไข่","DESSERT","แป้งพายสำเร็จรูปแช่แข็ง    8-9 ชิ้น," +
                "ไข่ไก่    2 ฟอง," + "ไข่แดง    1 ฟอง," + "น้ำตาลทราย    50 กรัม,"+ "เนมจืด    200 มิลลิลิตร,วิปปิ้งครีม    100 มิลลิลิตร,กลิ่นวานิลลา    1/2 ช้อนชา,เกลือนิดหน่อย"
                ,"เริ่มจากตีไข่และน้ำตาลทรายจนน้ำตาลทรายละลาย,ใส่นม วิปครีม กลิ่นวานิลลา และเกลือ คนส่วนผสมให้เข้ากันแล้วกรองด้วยกระชอน หรือผ้าขาวบาง,นำส่วนผสมที่กรองแล้วตักใส่ถ้วยให้เต็ม สูตรนี้ทำได้ 8-9 ถ้วยค่ะ,ก่อนนำเข้าเตาอบให้เปิดวอร์มเตาไว้ก่อนประมาณ 15 นาที เปิดไฟบน-ล่างที่อุณหภูมิ 175 องศาเซลเซียส นำเข้าเตาอบ 30-35 นาที หรือจนกว่าขนมจะสุก","des_tart"));
        databaseAccess.insertContact(new FoodInfo("ช็อกโกแลตบอล","DESSERT","เนื้อเค้ก (เช่น บัตเตอร์เค้ก เค้กช็อกโกแลต เค้กวานิลลา ฯลฯ)," +
                "ผงโกโก้," + "ช็อกโกแลต หั่นเป็นชิ้นเล็ก," + "เกล็ดน้ำตาล สำหรับแต่ง"
                ,"ใส่เนื้อเค้กในอ่างผสม เติมผงโกโก้ (หรือช็อกโกแลตละลาย) ลงไป บดผสมให้ละเอียดและเข้ากันเป็นเนื้อเดียว จากนั้นปั้นส่วนผสมเป็นลูกกลม เตรียมไว้,นำช็อกโกแลตไปละลายในไมโครเวฟ ประมาณ 10 วินาที นำออกจากเตา คนผสมจนเนื้อเนียน,ใช้ไม้ปลายแหลม หรือไม่จิ้มฟัน จิ้มช็อกบอลแล้วจุ่มลงในช็อกโกแลตละลายจนทั่วทั้งลูก โรยด้วยเกล็ดน้ำตาล แต่งให้สวยงามตามชอบ พักทิ้งไว้จนขนมเริ่มเซตตัว จัดเสิร์ฟ","des_choc"));
        databaseAccess.insertContact(new FoodInfo("แพนเค้ก","DESSERT","แป้งเค้ก     120 กรัม," +
                "ผงฟู    1 ช้อนชา," + "ชเบกกิ้งโซดา    1 ช้อนชา," + "เน้ำตาลทราย    4 ช้อนโต๊ะ,เกลือป่น    1/4 ช้อนชา,นมสด    200 กรัม,น้ำมันรำข้าว (หรือน้ำมันพืช)    25 กรัม,ไข่แดง (เบอร์ 0)    1 ฟอง,ไข่ขาว (เบอร์ 0)    1 ฟอง,กลิ่นวานิลลา,น้ำผึ้ง,ล้วยหอม,น้ำตาลไอซิ่ง"
                ,"ผสมนมสด น้ำมันพืช ไข่แดง กลิ่นวานิลา น้ำตาลทราย และเกลือป่น คนจนเข้ากัน จากนั้นเทลงไปในชามส่วนผสมของแห้งซึ่งประกอบไปด้วยแป้งเค้ก ผงฟู และเบกกิ้งโซดา ที่ร่อนเตรียมไว้ แล้วตะล่อมจนเข้ากัน,ตีไข่ขาวให้เป็นฟองหยาบแล้วทยอยใส่น้ำตาลทรายส่วนที่เหลือลงไป ตีจนตั้งยอดกลาง ๆ ค่ะ หลังจากนั้นตักไข่ขาวลงไปผสมบางส่วน ตะล่อมให้เข้ากัน แล้วใส่ไข่ขาวที่เหลือลงไป คนตะล่อมจนเข้ากัน" +
                ",ตั้งกะทะ ใช้ไฟอ่อน ๆ ตักแพนเค้กลงไป เกลี่ยให้เป็นวงกลม พอมีฟองปุด ๆ เล็ก ๆ ทั่วแพนเค้ก ให้ลองแซะดูด้านล่างว่าหลืองสุกดีหรือยัง พอเหลืองสุกได้ที่แล้วก็พลิกอีกด้านนึงค่ะ พอสุกทั้งสองด้านก็ตักมาพักไว้,ราดด้วนน้ำผึ้ง ตกแต่งด้วยน้ำตาลไอซิ่งและผลไม้ตามใจชอบ","des_pancake"));


        databaseAccess.close();

    }

}
